system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary; //defines dictionary type
    object      snappyHexMeshDict; // tells OpenFOAM this is the snappyHexMeshDict
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true; // removes cells from stl, refines mesh near geometry
snap            true; //moves mesh vertices and aligns them to STL surface
addLayers       false; //adds prismatic boundary layers


// Geometry. Definition of all surfaces. All surfaces are of class
// surface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    car //Car body and floor
    {
        type triSurfaceMesh; //triangulated surface (STL)
        file "F1_car_m_half.stl"; //name of the file in constant geometry
    }
    FW // Front wing
    {
        type triSurfaceMesh; //triangulated surface (STL)
        file "F1_FW_m_half.stl"; //name of the file in constant geometry
    }
    RW // Rear wing
    {
        type triSurfaceMesh; //triangulated surface (STL)
        file "F1_RW_m_half.stl"; //name of the file in constant geometry
    }
    RWHL //Rear wheels 
    {
        type triSurfaceMesh; //triangulated surface (STL)
        file "F1_RWHL_m_half.stl"; //name of the file in constant geometry
    }
    FWHL //Car wheels front
    {
        type triSurfaceMesh; //triangulated surface (STL)
        file "F1_FWHL_m_half.stl"; //name of the file in constant geometry
    }
    SidepodInletR
    {
        type searchablePlate;
        origin (1.192 0.39 0.49); //origin point of the rectangle
        span (0 0.21 0.07);    //Height width of rectangle
    }

    Outerbox // Refinement region behind the car
    {
        type searchableBox;
        min ( -4.5 0 0);
        max ( 25  6 4.5);

    }
    Middlebox // Refinement region behind the car
    {
        type searchableBox;
        min ( -3.5 0 0.0);
        max ( 15  5 3.5);

    }
    Innerbox // Refinement region behind the car
    {
        type searchableBox;
        min ( -3 0 0.0);
        max ( 12  4 2.5);

    }
    InnermostBox 
    {
        type searchableBox;
        min ( -1.5 0 0.0);
        max ( 5  1 1);

    }
    FW_Box
       {
        type searchableBox;
        min ( -1.1 0 0.0);
        max ( -0.35 0.85 0.3);

    }
};



// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 5000000;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 80000000;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 10;

    // Allow a certain level of imbalance during refining
    // (since balancing is quite expensive)
    // Expressed as fraction of perfect balance (= overall number of cells /
    // nProcs). 0=balance always.
    maxLoadUnbalance 0.10;


    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 4;



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/geometry for now.

    features
    (
        {
            file "F1_car_m_half.eMesh";
            level 6; //go back to 4 maybe?
        }
        {
            file "F1_FW_m_half.eMesh";
            level 6;
        }
          {
            file "F1_RW_m_half.eMesh";
            level 5;
        }
        {
            file "F1_FWHL_m_half.eMesh";
            level 4;
        }
        {
            file "F1_RWHL_m_half.eMesh";
            level 4;
        }

    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

refinementSurfaces
{   
    car
    {
        level (5 6); //any cell interesecting the surface is refined at least al level 4, maximum is 5 (level N = baseCell/2^N)
        patchInfo
        {
            type wall; //States that the patch after cutting the car out and refining will be a wall
        }
    }
    FWHL
    {
        level (3 4); //any cell interesecting the surface is refined at least al level 4, maximum is 5 (level N = baseCell/2^N)
        patchInfo
        {
            type wall; //States that the patch after cutting the car out and refining will be a wall
        }
    }
    RWHL
    {
        level (3 4); //any cell interesecting the surface is refined at least al level 4, maximum is 5 (level N = baseCell/2^N)
        patchInfo
        {
            type wall; //States that the patch after cutting the car out and refining will be a wall
        }
    }
    FW
    {
        level (5 6); //any cell interesecting the surface is refined at least al level 4, maximum is 5 (level N = baseCell/2^N)
        patchInfo
        {
            type wall; //States that the patch after cutting the car out and refining will be a wall
        }
    }
    RW
    {
        level (4 5); //any cell interesecting the surface is refined at least al level 4, maximum is 5 (level N = baseCell/2^N)
        patchInfo
        {
            type wall; //States that the patch after cutting the car out and refining will be a wall
        }
    }
    SidepodInletR
    {
        level (5 6); //any cell interesecting the surface is refined at least al level 4, maximum is 5 (level N = baseCell/2^N)
        faceZone    SidepodInletR;
        faceType    internal; // keeps faces connected, flow passes through
    }
}


    // Resolve sharp angles
    resolveFeatureAngle 50; //uses level 4 refinement


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

refinementRegions
{
    Outerbox
    {
        mode    inside;
        level   1;
    }
    Middlebox
    {
        mode    inside;
        level   2;
    }
    Innerbox
    {
        mode    inside;
        level   3;
    }
    InnermostBox
    {
        mode    inside;
        level   5;
    }
    FW_Box
    {
        mode    inside;
        level   5;
    }
    car //artificial inflation layer creation
    {
        mode    distance;
        levels  ((0.001 6) (0.003 5) (0.01 4)); // every cell that is 0.003 m distant from the surface gets refined level 5 every cell withing 0.01m from the surface gets refined level 4
    }
    FW
    {
        mode    distance;
        levels  ((0.002 6) (0.005 5));
    }
    RW
    {
        mode    distance;
        levels  ((0.002 5) (0.005 4));
    }
    FWHL
    {
        mode    distance;
        levels  ((0.002 4) (0.01 3));
    }
    RWHL
    {
        mode    distance;
        levels  ((0.002 4) (0.01 3));
    }
}

    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the insidePoint is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    insidePoint (-4 2 2); //random point in fluid zone


    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 5; //lower more faithful but unstable

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 0.6; //before was 1 too aggresive?

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 50;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 10;

    // Feature snapping

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 10; //number of attemps to feautre edges

        //- Detect (geometric only) features by sampling the surface
        //  (default=false).
        implicitFeatureSnap false;

        //- Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        //- Detect points on multiple surfaces (only for explicitFeatureSnap)
        multiRegionFeatureSnap false;
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes false;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        "car.*"
        {
            nSurfaceLayers 5;
        }
        "FW.*"
        {
            nSurfaceLayers 5;
        }
        "RW.*"
        {
            nSurfaceLayers 5;
        }
        "RWHL.*"
        {
            nSurfaceLayers 3;
        }
        "FWHL.*"
        {
            nSurfaceLayers 3;
        }
    }

    // Expansion factor for layer mesh

    expansionRatio 1.20;

    // First layer thickness (y+ = 75 at 300km/h)
    firstLayerThickness 0.0004;  // , y+75

    //finalLayerThickness 0.5 // more robust than firstLayerThickness in this case 50% of adjacent cell

    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // Relative to undistorted size of cell outside layer.
    // Minimum layer thickness - if can't achieve this, don't add layer

    minThickness 0.00013;         // 33% of first layer

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)

    nGrow 1; // changed for smooth layer termination

    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 60;

    // At non-patched sides allow mesh to slip if extrusion direction makes
    // angle larger than slipFeatureAngle. Default is 0.5*featureAngle.
    slipFeatureAngle 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 20;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 5;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 10;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.6;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.5;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 17x! 90 degrees corresponds to 130 in 17x.
    minMedianAxisAngle 90;


    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 1;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;
    meshShrinker displacementMedialAxis;
}




// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"
}


// Advanced

// Write flags
writeFlags
(
    //scalarLevels //writes a field showing the refinement level per cell
    layerSets  //relevant for layers
    //layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;

// ************************************************************************* //
