0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    //#include "include/fixedInlet"
    inlet       
    { 
        type freestreamVelocity; 
        freestreamValue uniform (91.7 0 0); 
        value uniform (91.7 0 0); 
    }
    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (91.7 0 0);
        value           uniform (91.7 0 0);
    }

    lowerWall
    {
        type            fixedValue;
        value           $internalField;
    }

    car
    {
        type            noSlip;
    }
    FW
    {
        type            noSlip;
    }
    FWHL
    {
        type            noSlip;
    }
    RWHL
    {
        type            noSlip;
    }
    RW
    {
        type            noSlip;
    }




    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
