0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0]; // [Mass, Lenght,Time, temperature, Mol, Current, Luminouse intensity]

pOut            1e5;

internalField   uniform $pOut;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 1e5;
    }

    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 1e5;
    }
    freestream  
    { 
        type            freestreamPressure; 
        freestreamValue uniform 1e5; 
    }
    lowerWall
    {
        type            zeroGradient;
    }
    upperWall       
    { 
        type            zeroGradient; 
    }
    car
    {
        type            zeroGradient;
    }
    FW
    {
        type            zeroGradient;
    }
    FWHL
    {
        type            zeroGradient;
    }
    RWHL
    {
        type            zeroGradient;
    }
    RW
    {
        type            zeroGradient;
    }




}

// ************************************************************************* //
