0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          298.15;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           uniform $Tinlet;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           uniform $Tinlet;
    }
    freestream
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           uniform $Tinlet;
    }

    lowerWall       { type zeroGradient; }
    upperWall       { type zeroGradient; }

    car             { type zeroGradient; }
    FW              { type zeroGradient; }
    FWHL            { type zeroGradient; }
    RWHL            { type zeroGradient; }
    RW              { type zeroGradient; }
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //