0/include/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

upperWall
{
    type slip;
}

//frontAndBack
//{
//    type slip;
//}

freestream        // was frontAndBack (the +y outer side)
{
    type    slip;
}
symmetry          // new entry for y=0 plane
{
    type    symmetry;
}

// ************************************************************************* //
