0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    freestream
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    upperWall       { type zeroGradient; }

    lowerWall       { type omegaWallFunction; value $internalField; }
    car             { type omegaWallFunction; value $internalField; }
    FW              { type omegaWallFunction; value $internalField; }
    FWHL            { type omegaWallFunction; value $internalField; }
    RWHL            { type omegaWallFunction; value $internalField; }
    RW              { type omegaWallFunction; value $internalField; }
}


// ************************************************************************* //
